/*
1. Выведите столбец чисел от 1 до 100.
 */

/*
let i = 0;
while(i <= 100){
    document.write(i + '<br>');
    i++;
}
*/

/*
for(let i = 0; i <= 100; i++){
    document.write(i + '<br>');
}
*/

////////////////////////////////

/*
2. Выведите столбец чисел от 11 до 33.
 */

/*
let i = 11;
while(i <= 33){
    document.write(i + '<br>');
    i++;
}
*/

/*
for(let i = 11; i <= 33; i++){
    document.write(i + '<br>');
}
*/

//////////////////////////////////////

/*
3. Выведите столбец четных чисел в промежутке от 0 до 100.
 */

/*
let i = 0;

while(i <= 100){
    document.write(i + '<br>');
    i+=2;
}
*/

/////////////////////////////////

/*
4.  С помощью цикла найдите сумму чисел от 1 до 100.
 */
/*
let sum = 0;
for (let i = 1; i <= 100; i++) {
    sum += i;
}
alert(sum);
*/

/*
let sum = 0;
let i = 1;

while(i <= 100){
    sum+=i;
    i++;
}
alert(sum);
*/

/////////////////////////////////////

/*
5. Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for выведите все эти элементы на экран.
 */

//let arr = [1, 2, 3, 4, 5];

/*
for(let i = 0; i < arr.length; i++){
    document.write(arr[i] + '<br>');
}
*/
/*
arr.forEach(function(i){
    document.write(i + '<br>');
});
*/

//////////////////////////////////

/*
6. Дан массив с элементами [1, 2, 3, 4, 5].
С помощью цикла for найдите сумму элементов этого массива. Запишите ее в переменную result.
 */

/*
let arr = [1, 2, 3, 4, 5];
let result = 0;


for(let i = 0; i < arr.length; i++){
    result += +arr[i];
}

alert(result);
*/
/*
let arr = [1, 2, 3, 4, 5];
let result = 0;

arr.forEach(function(i){
   result+= +i;
});
alert(result);
*/

//////////////////////////////

/*
7. Дан объект obj. С помощью цикла for-in выведите на экран ключи и элементы этого объекта.
 */

/*
let obj = {green: 'зеленый', red: 'красный', blue: 'голубой'};
for(let key in obj){
    document.write(key + '<br>');
}
*/

////////////////////////////////

/*
8. Дан объект obj с ключами Коля, Вася, Петя с элементами '200', '300', '400'. С помощью цикла for-in выведите на экран строки такого формата: 'Коля - зарплата 200 долларов.'.
 */

/*
let obj = {'Коля': 200, 'Вася': 300, 'Петя': 400 };

for(let key in obj){
    document.write(`${key} зарплата ${obj[key]} долларов <br>`);
}

*/

///////////////////////

/*
9. Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла for и оператора if выведите на экран столбец тех элементов массива, которые больше 3-х, но меньше 10.
 */

/*
let arr = [2, 5, 9, 15, 0, 4];

for(let i = 0; i < arr.length; i++){
    if(arr[i] > 3 && arr[i] < 10){
        document.write(arr[i] + '<br>');
    }
}
*/

/////////////////////////

/*
10. Дан массив с числами. Числа могут быть положительными и отрицательными. Найдите сумму положительных элементов массива.
 */

/*
let arr = [2, 5, 9, 15, 0, 4, -2, -5, 1];

let sum = 0;

for(let i = 0; i < arr.length; i++){
    if(arr[i] > 0){
        sum += arr[i];
    }

}
document.write(sum + '<br>');
*/

////////////////////////////

/*
11. Дан массив с элементами 1, 2, 5, 9, 4, 13, 4, 10. С помощью цикла for и оператора if проверьте есть ли в массиве элемент со значением, равным 4. Если есть - выведите на экран 'Есть!' и выйдите из цикла. Если нет - ничего делать не надо.
 */

/*
let arr = [1, 2, 5, 9, 4, 13, 4, 10];

for(let i = 0; i < arr.length; i++){
    if(arr[i] === 4){
        alert(true);

    }else{
        alert(false);

    }
}
*/

///////////////////////////////

/*
12. Дан массив числами, например: [10, 20, 30, 50, 235, 3000]. Выведите на экран только те числа из массива, которые начинаются на цифру 1, 2 или 5.
 */

/*
let arr = ['10', '20', '30', '50', '235', '3000'];

for(let i = 0; i < arr.length; i++){
    if(arr[i][0] === '1' || arr[i][0] === '2' || arr[i][0] === '5'){
        alert(arr[i]);
    }
}
*/

/////////////////////////////

/*
13. Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла for создайте строку '-1-2-3-4-5-6-7-8-9-'.
 */

/*
let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
let str = '';

arr.forEach(function(i){
    str += '-' + i;
});
document.write(str);
*/

/*
//2в
let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
let str = '';
str = arr.join('-');
alert(str);
*/

/////////////////////////////

/*
14. Составьте массив дней недели. С помощью цикла for выведите все дни недели, а выходные дни выведите жирным.
 */

/*
let arr = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'];

for(let i = 0; i < arr.length; i++){
    if(i >= 5 && i <= 6){
        document.write(`<strong>${arr[i]}</strong> <br>`);
    }else{
        document.write(`${arr[i]} <br>`);
    }
}
*/


/////////////////////////


/*
16. Дано число n=1000. Делите его на 2 столько раз, пока результат деления не станет меньше 50. Какое число получится? Посчитайте количество итераций, необходимых для этого (итерация - это проход цикла), и запишите его в переменную num.
 */

/*
let num = 1000;
let i = 0;
while(num >= 50){
    num /= 2;
    i++;
}
document.write(num + ' ' + ' ' + i);
*/
