/*
1. Сделайте функцию, которая возвращает квадрат числа. Число передается параметром.
 */

/*
function kvadrat(num){
    return num*num;
}

alert(kvadrat(5));
alert(kvadrat(6));
alert(kvadrat(7));
*/

/////////////

/*
2.  Сделайте функцию, которая возвращает сумму двух чисел.
 */

/*
function getSumm(a, b){
    return a + b;
}

alert(getSumm(5, 25));
*/

//////////////////

/*
3. Сделайте функцию, которая принимает параметром число от 1 до 7, а возвращает день недели на русском языке.
 */

/*
function getDay(day){
    let arr = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
    return arr[day-1];
}

alert(getDay(6));
*/
